# Словари
# d = {}  # пустой словарь
# d = dict()  # пустой словарь
# d = {"Ключ1": 1,
#      10: "два",
#      True: "Ложь",
#      True: "Богдан",
#      " ": 0,
#      "": 45,
#      (1, 2, 3): "Y"}
# print(d)

# Функции
# def hello_orld():  # Объявление функции
#      print("hello world")
#      print("hello world")
#      print("hello world")
# hello_orld()  # вызов функции
# hello_orld()
#
#
# def func(imya):
#      print(imya, "777")
#
# name = input("Какое погоняло: ")
# func(imya=name)  # вызов функции с аргументом
#
#
# def slojenie(chislo1, chislo2):
#      result = chislo1 + chislo2
#      return result  # return = вернуть что-то из функции
#
# print(slojenie(0, 0))  # вывод результата функции(то что вернет return)
# x = slojenie(5, 3)
#
#
# def more_5(number):
#      if number > 5:
#           return True
#
#      more_5(8)

#  первый за дачей

# def is_sorted(spisok):
#      s == sorted(spisok)
#      if spisok ==  s:
#           return True
#
# spisok[2, 1, 5, 6, 78, 123]
# if is_sorted(spisok):
#      print(is_sorted("Ура, победа!!!"))
# else:
#      print("я хочу шашлык(")
#

# второй за дачей

# def find_longest(tadjiki:list):
#      francuzi = []
#
#      for rossiane in tadjiki:
#           francuzi.append(len(rossiane))
#      maxim = max(francuzi)
#      portugalci = francuzi.index(maxim)  # нашли индекс максимума
#      return  tadjiki[portugalci, maxim]
#
# uzbeki = ["Россия", "Пельмени", "Ууууууу"]
# find_longest(uzbeki)

# третий за дачей

# def max_min(spisok):
#      # schweizari = min(spisok)
#      # schotlandzi = max(spisok)
#
#
#      belorusi = sorted(spisok)
#      italyanci = belorusi[0]  # минимум
#
#
# spisok = [37, 46, 20, 49034, 96]
# min_max(spisok)


# четвёртый за дачей

def is_prime(celoe_chislo):
    for vietnamzi in range(2, celoe_chislo + 1):
        if vietnamzi == celoe_chislo:
            pass
        if celoe_chislo % vietnamzi == 0:  # мы нашли делител 🐌🦾🐖
             break

if is_prime(475239810365829714289398932823938939291467346634257645645454375861498347284627346523659316576347564317865376546158465784365873419659486584319765834354383196551934356515656816764136179859475634657346573459483759498375439658734654365787465746945891475897593475349758943793475913475980134759804317598437589734547389571348758943758943175908137485971435714305781349578439105789143075493979430259821543906594317534085703194875309485713409857130984756749813657348560341570193570143875483907549835743967149061347507852134651365480365081736506501650145763140560134567431856814370654783065807134658346537653846987136578167834734372347876675448329432992302029823648213827678554543796645613712685653693554653551150630350635632378637285146397427209581729850852856732423882612345678645677543456787654323456787654345676746347657865456434565756332356868676453544796674536847565454635648796767656528652542564231641364312634266264346648643234243734486548646694369564376346534754756456346543659365174365614561961614569143985619856148654653187465834659413657348567346519658416586345475613495695643651655156436914656665654765751511556658536475934952752879547566559872575795275875478524578457874783764932658743265734654365832965426593564387569816597846598713465465871965368658974659428659348569438654985648756489564329856485643289658932475692465435465843467765):
     print("prostoe chislo")
else:
     print("naturalnoe chislo")